; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image2 - mode
	image0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
)
(:goal (and
	(pointing satellite0 Star13)
	(have_image Planet11 thermograph1)
	(have_image Star12 image2)
	(have_image Star13 image2)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 image2)
	(have_image Planet17 image0)
	(have_image Planet18 image2)
	(have_image Phenomenon19 image2)
))

)

; plan
1. (turn_to satellite0 groundstation1 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   goals met: 0 of 10
5. (take_image satellite0 planet11 instrument1 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon19 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon19)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon19 instrument1 image2)
   added: (have_image phenomenon19 image2)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon15 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon15 instrument1 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 4 of 10
12. (turn_to satellite0 planet17 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet17)
   goals met: 4 of 10
13. (take_image satellite0 planet17 instrument1 image0)
   added: (have_image planet17 image0)
   goals met: 5 of 10
14. (turn_to satellite0 planet18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet18)
   goals met: 5 of 10
15. (take_image satellite0 planet18 instrument1 image2)
   added: (have_image planet18 image2)
   goals met: 6 of 10
16. (turn_to satellite0 star12 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star12)
   goals met: 6 of 10
17. (take_image satellite0 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 7 of 10
18. (turn_to satellite0 star16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star16)
   goals met: 7 of 10
19. (take_image satellite0 star16 instrument1 image2)
   added: (have_image star16 image2)
   goals met: 8 of 10
20. (turn_to satellite0 star13 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star13)
   goals met: 9 of 10
21. (take_image satellite0 star13 instrument1 image2)
   added: (have_image star13 image2)
   goals met: 10 of 10
